/*Настроить проект, вывести в консоль “Hello world!”.
Вывести в консоль системные дату и время.*/

import java.time.LocalDateTime;

public class sem1z1 {

    public static void main(String[] args) {
        System.out.println("Hello world");    
System.out.println(LocalDateTime.now());
    }
}